### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:36",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:30" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:30/invocations" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "30" -> (known after apply)
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "30" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "8065086791150680276" -> (known after apply)
!       triggers = {
!           "timestamp" = "1692301787835334000" -> "1692303106880846000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:36" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-17T19:52:04.561+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:36" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/8ac76100d8554528681f41292a23ca87600ae9f6da20337cdc84156018294bc7.zip" -> "builds/6b605bc2c4aa6bb44e1dea72bd4f7b70aa996ffdfe8eaf9322917979b0142ff0.zip"
!       s3_object_version           = ".w1JzWeXkXQcB6nxEt0MORnszLmHnWQU" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "dy2Bv2TJSnuU068i5bftKcu9C6GCRO2dr1eg/bUh75g=" -> (known after apply)
!       source_code_size            = 29716887 -> (known after apply)
!       version                     = "36" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "0a81f2e64ee0055f523ba2299d8dade4-6" -> (known after apply)
!       id                     = "builds/8ac76100d8554528681f41292a23ca87600ae9f6da20337cdc84156018294bc7.zip" -> (known after apply)
!       key                    = "builds/8ac76100d8554528681f41292a23ca87600ae9f6da20337cdc84156018294bc7.zip" -> "builds/6b605bc2c4aa6bb44e1dea72bd4f7b70aa996ffdfe8eaf9322917979b0142ff0.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/8ac76100d8554528681f41292a23ca87600ae9f6da20337cdc84156018294bc7.zip" -> "builds/6b605bc2c4aa6bb44e1dea72bd4f7b70aa996ffdfe8eaf9322917979b0142ff0.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = ".w1JzWeXkXQcB6nxEt0MORnszLmHnWQU" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/6b605bc2c4aa6bb44e1dea72bd4f7b70aa996ffdfe8eaf9322917979b0142ff0.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/6b605bc2c4aa6bb44e1dea72bd4f7b70aa996ffdfe8eaf9322917979b0142ff0.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "5926389556017804693" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/8ac76100d8554528681f41292a23ca87600ae9f6da20337cdc84156018294bc7.zip" -> "builds/6b605bc2c4aa6bb44e1dea72bd4f7b70aa996ffdfe8eaf9322917979b0142ff0.zip"
!           "timestamp" = "1692301789386278000" -> "1692303108515985000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "3559698791911814922" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/8ac76100d8554528681f41292a23ca87600ae9f6da20337cdc84156018294bc7.zip" -> "builds/6b605bc2c4aa6bb44e1dea72bd4f7b70aa996ffdfe8eaf9322917979b0142ff0.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 7 to add, 1 to change, 6 to destroy.
```
</details>